/********************************************************/
//
//  概要
//      WDT関連
//  作成者
//		K.ishimori @ TUTrobo
//
/********************************************************/

#include "../setup.h"		//マイコンの設定

/********************************************************/
//  名前      
//		wdt_init	
//  概要
//      WDT関連
//  機能説明
//		WDTの初期設定
//  パラメタ説明
//		なし
//  戻り値
//		なし
//  作成者
//		TUTrobo
//
/********************************************************/
void wdt_init(void)
{
	WDT.WRITE.WINA=0x5a00;
	WDT.WRITE.WINA=0xa5fd;
		//ウォッチドッグタイマモードでパワーオンリセット
								//周期は（41.943 	ms）に設定
	
								//0： Pφ/4 		（		us）
								//1： Pφ/64 	（		us）
								//2： Pφ/128 	（	us）
								//3： Pφ/512 	（	us）
								//4： Pφ/2048 	（	us）
								//5： Pφ/8192 	（ms）
								//6： Pφ/32768 	（	ms）
								//7： Pφ/131072 	（ 	ms）
	
}

/********************************************************/
//  名前      
//		wdt_reset	
//  概要
//      WDT関連
//  機能説明
//		WDTのカウントリセット
//  パラメタ説明
//		なし
//  戻り値
//		なし
//  作成者
//		TUTrobo
//
/********************************************************/
void wdt_reset(void)
{
	
	WDT.WRITE.WINA = 0x5a00;		//カウントリセット
	
}

/********************************************************/
//  名前      
//		wdt_init	
//  概要
//      WDT関連
//  機能説明
//		WDTの初期設定
//  パラメタ説明
//		なし
//  戻り値
//		なし
//  作成者
//		TUTrobo
//
/********************************************************/
void wdt_stop(void)
{
	
//	WDT.WRITE.WINA = 0x5a00;	//カウントを0に設定
	WDT.WRITE.WINA = 0xa5dd;	//ウォッチドッグタイマモードでパワーオンリセット
								//周期はPφ/4096（41.943 	ms）に設定
	
								//0： Pφ 		（10.24		us）
								//1： Pφ/4 	（40.96		us）
								//2： Pφ/16 	（168.34	us）
								//3： Pφ/32 	（327.68	us）
								//4： Pφ/64 	（655.36	us）
								//5： Pφ/256 	（2.6214	ms）
								//6： Pφ/1024 	（10.486	ms）
								//7： Pφ/4096 	（41.943 	ms）
	
}
