/********************************************************/
//
//  概要
//      WDT関連
//  作成者
//		K.ishimori @ TUTrobo
//
/********************************************************/

#ifndef __WDT_H__
#define __WDT_H__

/********************************************************/
//  TUTrobo
//
//  概要
//      WDT関連 プロトタイプ宣言
/********************************************************/
void wdt_init(void);			// WDTの初期設定
void wdt_reset(void);			// WDTのカウントリセット
void wdt_stop(void);			// WDTを禁止

#endif //__WDT_H__