/********************************************************/
//
//  概要
//      計算用定数・マクロ郡 
//  作成者
//		TUTrobo
//
/********************************************************/

#ifndef __MACRO_H__
#define __MACRO_H__

//円周率
/********************************************************/
//  TUTrobo
//
//  概要
//      計算用定数・マクロ郡 
/********************************************************/
#define PI					3.1415926535							//円周率
#define ABS(x) 				(((x) > 0) ? (x) : -(x))				//絶対値
#define DEG2RAD(x)			((x)/180.0*PI)							//角度をラジアンに変更
#define RAD2DEG(x)			((x)/PI * 180.0)						//ラジアンを角度に変更
#define POW2(x)				((x)*(x))								//二乗
#define POW3(x)				((x)*(x)*(x))							//三乗
#define DIST(a,b,c,d)		(sqrt(POW2((c)-(a)) + POW2((d)-(b))))	//(a,b)->(c,d)の長さ

#endif // __MACRO_H__